<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [
    // 驱动方式
    'type'   => 'File',
    // 缓存保存目录
    'path'   => '',
    // 缓存前缀
    'prefix' => '',
    // 缓存有效期 0表示永久缓存
    'expire' => 0,
    /****新增****/
    //后台左边权限列列表缓存的名字
    'user_left_nav' => 'user_left_nav',  
    //用户m-c-a缓存
    'user_auth_mca' => 'user_auth_mca', 
    // 前台用户桌面缓存
    'user_desk_mca' => 'user_desk_mca', 
    //站点配置的缓存名 
    'config' => 'config', 
    //链接 
    'links' => 'links', 
    //栏目
    'column' => 'column', 
];
